{
  "betterAltar:BetterAltar": {
    "NAME": "Better Forgotten Altar",
    "DESCRIPTIONS": [
      "In front of you sits an altar to a forgotten god. NL Atop the altar sits an ornate female statue with arms outstretched. NL She calls out to you, #rdemanding #r@sacrifice.@",
      "You tear open a large gash in your side, letting the #rblood pour into the trough in front of the altar. As the liquid fills the container, you notice a @rumbling@ from underneath the surface. NL NL In a flash, a small [#7a7a7a]idol[] somehow floats to the surface.",
      "You stand on the altar and cut your wrists. NL As your #rblood drips onto the altar, you feel a sudden ~heaviness~ coming on. NL You reach into your pocket and discover a strange vial containing mysterious looking liquid.",
      "Picking up a small bottle of #bpowder, you prick your finger with a small needle, and squeeze a few drops into it. NL Your #rblood seems to react quite @violently@ with the #bpowder at first, but eventually settles down into a strange spotted liquid.",
      "You were never one to believe in superstition. NL You ignore the pleas in your mind, and turn to leave. NL As you do, however, you feel a slight tingle in your core... NL NL Probably nothing.",
      "As you gently set the idol onto the altar a #bcold wind swirls throughout the room. NL You clumsily prick your finger on the edge of the idol. NL As the single drop of #rblood runs down the idol, it begins to dull in color and begins ~bleeding~ from its eyes. NL The ~bleeding~ never ceases.",
      "As you gently set the vial onto the altar a #ywarm wind swirls throughout the room. NL The statue seemingly comes to life and begins crying tears of a strange #bcolored #bliquid into the #rvial. NL She reaches out, offering you the #pvial, and suddenly returns to stone. NL You carefully dislodge the #pvial.",
      "Feeling weakened from your #rofferings, but satisfied with your #yrewards, you move on your way. NL NL You feel a warm presence behind you as you leave, as if the statue is smiling upon you."
    ],
    "OPTIONS": [
      "[Sacrifice] #rLose #r",
      " #rHP. #gObtain #ga #gspecial #gRelic.",
      " #rHP. #gObtain #gBlood #gVial.",
      "[Defy] #rBecome #rCursed #r- #rDecay.",
      "[Leave]",
      " #rHP. #gObtain #ga #gUnique #gPotion.",
      "[Locked] Already taken.",
      "[Proceed]",
      "[Offer: Golden Idol] #rLose #rGolden #rIdol. #rLose #r",
      "[Offer: Blood Vial] #rLose #rBlood #rVial. #rLose #r"
    ]
  },

  "betterAltar:Vampires": {
    "NAME": "Vampires(?)",
    "DESCRIPTIONS": [
      "The pale figures gasp as you take out the #pVial. NL ~\"The~ ~false~ ~one's~ ~blood...~ ~the~ ~false~ ~one's~ ~blood!~ @THE@ @FALSE@ @ONE'S@ @BLOOD!\"@ NL The tall one speaks to you. \"Hand us this #p~vile~ #p~drink,~ that we may dispose of it forever.\" NL You hand over the #pvial, and she immediately turns to her companions. NL \"Cleanse them.\" NL You feel a sharp pain on the back of your neck, as your vision immediately ~warps~ and fades to darkness. NL NL You wake up some time later, alone. An intense ~hunger~ passes through your belly. You #rmust #rfeed."    ],
    "OPTIONS": [
      "[Accept] #gRemove #gall Strikes. #gReceive #g5 Bites. #rLose #r",
      " #rMax #rHP.",
      "[Refuse]",
      "[Lose ",
      "] #gRemove #gall Strikes. #gReceive #g5 Bites.",
      "[Leave]"
    ]
  }
}
